[
  {
    "path": "posts/welcome/",
    "title": "Welcome to My Blog",
    "description": "Welcome to our new blog, My Blog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-06-22",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-22T19:47:24+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-06-22-dataviz2/",
    "title": "DataViz_Makeover2",
    "description": "Singapore Merchandise Trade Performance with Major Trading Partners (2020)",
    "author": [
      {
        "name": "LI NAN",
        "url": "https://www.linkedin.com/in/li-nan-63b9251a6/"
      }
    ],
    "date": "2021-06-20",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1.Original Visualization\r\n2.Critiques from Clarity and Aesthetic2.1 Clarity\r\n2.2 Aesthetic\r\n\r\n3.Proposed Design3.1 Sketch\r\n3.2 Clarity Improvement\r\n3.3 Aesthetic Improvement\r\n\r\n4.Steps of Data Visualization4.1 Data Preparation\r\n4.2 Data Visualization4.2.1 Bubble-Pie chart\r\n\r\n\r\n5. Final Visualization5.1 Dashboard\r\n5.2 Observation\r\n\r\n\r\n\r\n#TOC {\r\n  color: #708090;\r\n  font-family: Calibri;\r\n  font-size: 16px; \r\n  border-color: #708090;\r\n}\r\n#header {\r\n  color: #FF4500;\r\n  background-color: #F5F5F5;\r\n  opacity: 0.6;\r\n  font-family: Calibri;\r\n  font-size: 24px;\r\n}\r\nbody {\r\n  color: #708090;\r\n  font-family: Calibri;\r\n  background-color: #F5F5F5;\r\n}\r\npre {\r\n  color: #708090;\r\n  background-color: #F8F8FF;\r\n}\r\n1.Original Visualization\r\nThis original visualization is shown below. The chart describes Singapore merchandise trade performance among 10 major trading countries in the world. The chart is created by using data provided by Department of Statistics, Singapore (DOS). The dataset is available under the sub-section of Merchandise Trade by Region/Market. Figure below shows the Original Visualization.\r\nFigure 1 Original Visualization\r\n2.Critiques from Clarity and Aesthetic\r\n2.1 Clarity\r\n1) This bubble chart is lack of main title: The chart should have a title that specifies author’s observation or generalization and contains data range in specific years.\r\n2) The diagonal is shaded and not clear: Since this chart is divided into two separate parts: “Net Exporters” and “Net Importers” based on the diagonal, the diagonal should not be obscured by circles, making the readers hard to figure out which country is net exporter or net importer.\r\n3) The Opacity of each bubble should be adjusted: As the chart shows, some countries’ bubbles are shaded by other countries’ bubbles. For example: the center point of Republic of Korea is shaded by Japan bubble, which makes the reader not clear about its attribute (NET IMPORTER/NET EXPORTER).\r\n4) The meaning of annotation is not clear: The number in the annotation actually shows total merchandise value, but it does not state clearly in the note below the chart.\r\n5) The bubble chart lacks of details to support: In the bubble chart, the annotation only shows the total number of merchandise trade value, without providing more details of export and import or monthly trending to help readers to understand.\r\n2.2 Aesthetic\r\n1) Different colors specifying different countries are not necessary: Since each bubble has annotation to specify countries, it is untidy for the chart to specify too many kinds of color for different countries. The less is the more.\r\n2) The text section below the chart unnecessarily occupies too much location: The text section actually can be replaced by annotation in the chart or it can be introduced more vividly in animation. The text section is too tedious.\r\n3) All countries’ name should be in the same format: Only the European Union uses abbreviations “EU”, it should be unified to other countries’ names.\r\n4) The content of the diagram is too miscellaneous: it can be used by animation to show net exporters and net importers individually.\r\n3.Proposed Design\r\n3.1 Sketch\r\n\r\nFigure 2 Sketch\r\n3.2 Clarity Improvement\r\n1) Add calculation fields and reference line to do annotation: use calculation fields to get the value of net merchandise trade value and add a reference line to indicate average of the net value in the area chart.\r\n2) Clarify Net Exporter and Importer Roles and provide more details: To clarify net exporter and importer roles, we design bubble-pie chart as the main graph, accompanying with line graph (monthly export-import) and shade area graph to indicate country’s role. And in tooltip of Tableau, we also add annotation with national flag to clarify the role.\r\n3) Fix the problem of annotation in the original chart: In the bubble-pie chart we add tooltip to clarify the meaning of number and also label different color to different number to help understand its meaning.\r\n3.3 Aesthetic Improvement\r\n1) Add diagrams instead of tedious text comments: In the improved dashboard, we design three charts to interpret and also collect national flag images from Internet to make the interpretation of chart more intuitive and is easy to understand.\r\n2) Content Perfection: Instead of lacking exact period in main title, we add time period 2020 in the main title, and we also unify all country names without abbreviation-Change EU to European Union.\r\n3) The Opacity of each bubble is adjusted: In each chart in Dashboard, the opacity of areas is adjusted appropriately to present. In bubble-pie chart, the color of the boundary is also adjusted so that it can be seen visually.\r\n4.Steps of Data Visualization\r\n4.1 Data Preparation\r\n1） Clean Data to meet research scope The study period should be between January 2011-December 2020. So clean data that are not during this period in the following two data sheets in excel file.\r\nPurpose\r\nStep\r\nAction\r\nClean Data to meet research scope\r\nThe study period should be between January 2011-December 2020. Clean data that are not during this period in the two data sheets in excel file.\r\n\r\nFilter records\r\nUse Filter to filter out the records that are needed to be researched.\r\n\r\nUnify Data Type and Measurement(1)\r\nChange all data types of records to “number” in Excel to prepare for data analysis\r\n\r\nUnify Data Type and Measurement(2)\r\nFor data of Europe’s import and export in the data source, unify its measurement to “Thousand Dollars”\r\n\r\nDealing with Import/Export Data File\r\nIn the import and export data file, use “SUM’ function to calculate the sum of import and export from Jan,2020 to Dec,2020 separately and name their columns\r\n\r\nCreate a Summary sheet for all the aggregation data\r\nCopy the aggregation data from Import and Export data sheet and combine them in this new summary sheet for future preparation\r\n\r\nConnect tables for future use\r\nConnect three modified tables based on the primary key “Variables”\r\n\r\nPivot Table Edition (Export/Import)\r\nChange sheet structure of Import Summary and Export Summary to pivot table by clicking from 2020 Jan to 2020 Dec for future net value area chart and line chart edition\r\n\r\nPreparation for shape icon (national flags)\r\nTo visualize different country variables, Download national flag images from Country Flags to the Tableau file (Shapes/Flags) in the laptop.\r\n\r\n4.2 Data Visualization\r\n4.2.1 Bubble-Pie chart\r\n1) Basic Visualization Model (Bubble-Pie Chart)\r\nDrag “2020 Import Value” and “2020 Export Value” separately to y-axis and x-axis. And cancel Aggregation option in Analysis tab.\r\n\r\nFigure 3 Cancel Aggregation\r\nDrag Measure Names to color icon and Measure Values to Size icon and adjust chart type to pie chart to have a pie chart. Then, drag “Variables” to detail icon to have a basic model of bubble-pie chart.\r\n\r\nFigure 4 Adjustment\r\n\r\nFigure 5 Base Model\r\nChange the size of bubbles by adjusting size icon.\r\n\r\nFigure 6 Set Up Icons\r\nEdit axis to make x-axis and y-axis standardized.\r\n\r\nFigure 7 Axis Edition\r\nTo be more clearly to identify each pie chart, we need to add center point and adjust its border. Drag import value to rows to duplicate two charts and cancel other icons in “Sum 2020 Import Value” control panel, only left detail icons of “Variables(Summary), And then adjust color to yellow and adjust circles’ border to black to make circles intuitive and well-marked.\r\n\r\nFigure 8 Border Adjustment\r\n\r\nFigure 8 Central Point\r\nAnd then combine two charts together by using dual axis.\r\n\r\nFigure 8 Axis Dulation\r\nTo make the central point in the center of every bubble, use synchronize axis to make two axis standard and cancel “Show Header” to keep only one y-axis.\r\n\r\nFigure 9 Axis Dual\r\n\r\nFigure 10 Header Hidden\r\nFinally, set up the main chart header.\r\n\r\nFigure 11 Chart Title\r\n2) Net Merchandise Trade Area Chart and Export-Import Line Chart (For Tooltip)\r\nFor Tooltip indication to provide more details of Singapore merchandise trade with these major partners, design a new area and line chart to provide the details and trace the trend of Export and Import change in 2020. Drag Import Value and Export Value to Rows and Variables to Columns and set up Measure Values to Color icon. Then, drag period to Column and set up its measure to months. And it will appear a basic line chart for export and import.\r\n\r\nFigure 12 Line chart\r\nUse Dual Axis for Sum (Import Value) to combine two charts, synchronize the axis and cancel “Show the Header”.\r\n\r\nFigure 13 Dual Axis\r\nUse Calculation field to generate a new variable “Net Value1” for area chart use. Then drag it to rows and change the new chart type to area chart.\r\n\r\nFigure 14 Calculation Field\r\n\r\nFigure 15 Area Set up\r\n\r\nFigure 16 Line-Area Chart\r\nFor clearly observing the net value is negative or not, we add a reference line to clarify the average of net value, and use the format to accurate the figure to the nearest tenth.\r\n\r\nFigure 17 Reference Line\r\n\r\nFigure 18 Format\r\nCancel the header show of x-axis .\r\n\r\nFigure 19 Header Set up\r\n3) National Flag Table (For Tooltip)\r\nDrag Variables to Rows and set the calculation field for exporter and importer roles identification.\r\n\r\nFigure 20 Calculation Field\r\nAfter finishing the calculation field, drag Role to Rows to generate a new national flag table for future use.\r\n\r\nFigure 21 Flag Chart\r\n4) Add national flag chart, line chart and graph chart to tooltip of main chart\r\nInsert the modified two sheets to tooltip of main chart and set up the font size to 10 and change color of Export and Import Value. Then set up a new value “Total Value” .\r\n\r\nFigure 22 Tooltip\r\n5. Final Visualization\r\nAdd Main chart to dashboard and set up the legend to flowing to configure its location.\r\n5.1 Dashboard\r\n\r\nFigure 23 Dashboard\r\n5.2 Observation\r\n1) Extreme Value\r\nThe largest Major merchandise partner for Singapore among these countries is China, and the smallest merchandise partner is Thailand. For net merchandise trade value, country who gains the lowest merchandise trade net value is Taiwan, the highest is Hong Kong and the most balanced one is Japan, which means the value of Japan’s imports and exports from Singapore is well balanced\r\n2) Constant Value\r\nFor Export performance, Singapore’s export always outweighs its import with Hong Kong and Indonesia in every month of 2020. However, Singapore’s import is always higher than export with Malaysia and Taiwan. Singapore’s monthly rise and fall in Indonesia’s imports and exports are extremely synchronized.\r\n3) Trend Insight\r\nIn terms of exports, Singapore’s performance is not ideal. For most regions or countries , there is a downward trend in exports, except Hong Kong ,China and Taiwan these three partners, which shows increasing trend.\r\nOn the import side, it can be seen from the linear trend line that the proportion of partners that Singapore import increases and that import decreases is similar.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-22T20:13:45+08:00",
    "input_file": "dataviz2.utf8.md"
  },
  {
    "path": "posts/2021-06-26-dataviz1/",
    "title": "DataViz Makeover 1",
    "description": "Visualization makeover on merchandise trade with six trading countries(2019-2020)",
    "author": [
      {
        "name": "LI NAN",
        "url": "https://www.linkedin.com/in/li-nan-63b9251a6/"
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1.Original Visualization\r\n2.Critiques from Clarity and Aesthetic\r\n3.Proposed Design\r\n4.Steps of Data Visualization\r\n5.Final Visualisation\r\n\r\n1.Original Visualization\r\nThis original data visualization comes from Department of Statistics, Singapore. It describes merchandise trade values among six trading countries in two aspects, import and export. This visualization has some problems that needs to be corrected and some details of that need to be improved.\r\nFigure below shows the Original Visualization.\r\nFigure 1 Original Visualization\r\n2.Critiques from Clarity and Aesthetic\r\n2.1 Clarity\r\n1) X-axis title represents wrong unit of period: units of period are not unified in six charts and does not match chart title.\r\n2) Y-axis data range is confusing: data range and unit interval of Y-axis are not constant in two sides of chart (export and import), which makes data shown in charts are ambiguous and can not be compared obviously based on shape of charts.\r\n3) Chart representing Japan merchandise trade lacks elements: Chart representing Japan lacks unit of 2020.\r\n4) Title of charts does not express precisely: This chart title mentions about merchandise trade but do not clearly state which measure should be used（Export/Import/Merchandise Balance. These six countries are also not top 6 trading countries based on data source.\r\n2.2 Aesthetic\r\n1) Axis Orientation are lacked.\r\n2) Color of charts do not have any emphasis: Color choice in this chart is useless, two color representing in this chart are all light, which do not capture emphasis and are useless to express observation.\r\n3) Poor Chart choice without expressing focus: This visualization use six graphs to outline six countries merchandise trade situations. It is not the most appropriate choice-combining them to one graph to see difference and compare.\r\n4) Import and Export data visualization have some overlap that cant see the details: Color overlap and shading in this chart will affect observation of details in datasheet. Readers will be hard to observe detailed data.\r\n5) Font Size of Title is too small: Font size of title is not obvious and the title does not have any bold adjustment.\r\n6) Few figure annotations are added in charts: This chart are lacked of grid line, label number to clarify data.\r\n7) All the charts are the same size: the size of charts which are the same, are not good to let readers focus, it is better to have one chart to be the main one, others are to illustrate.\r\n3.Proposed Design\r\n3.1 Sketch\r\n\r\nFigure 2 Sketch\r\n3.2 Clarity Improvement\r\nInstead of using six graphs representing six countries which express ambiguous focus, use three charts that separately represents Trend of merchandise trade balance change, Import & Export and Total amount of merchandise trade to emphasize my observation.\r\nOnly selected figures (2019-2020) among six countries are chosen to shown consistently.\r\nAll unit intervals are consistent to express real scenarios.\r\nMain titles of chart will express precisely to show big picture and sub title will express observations that I want to express.\r\n3.3 Aesthetic Improvement\r\nThree different design of charts will not lead to aesthetic fatigue, and will be more focus on express of observation.\r\nFont Size of title and color of graphs will be adjusted appropriately to express important observations.\r\nGrid lines will be added to separate different countries.\r\nFigure annotation will be added in the charts to emphasize.\r\nDecrease the overlap of import and export chart.\r\nThe size of chart will be adjusted and they are not the same, One chart is a big picture, other charts are made to illustrate.\r\n4.Steps of Data Visualization\r\n4.1 Data Preparation\r\nFor data preparation, the data source is downloaded from Statistics Singapore and Excel and Tableau are implemented to do data preparation for our visualization.\r\n 1)Remove unnecessary columns and Filter\r\nHide Rows which do not present data from 2019-2020, and select countries that are from six trading countries and districts (Hong Kong, Taiwan, Mainland China, US, Malaysia and Japan)\r\n\r\nFigure 3 Origin Table\r\n2) Create and Transform Sheets\r\nCreate three sheets which name Export, Import and Merchandise Trade separately. Since 1-D sheet will be more suitable for Tableau to implement and use, these three tables are transformed from 2-D to 1-D format by Excel.\r\n\r\nFigure 4 1_D Table\r\n 3) Fix Data Problems \r\nSome Countries data are valued by million, some are valued by thousand. All data are transformed to measure in thousands.\r\n 4) Export Data to Tableau  Save and rename file as DataViz.\r\n 5) Build Relationships \r\n\r\nFigure 5 Relationship\r\n 6) Change Data Type \r\nTransform Date data type from String to Date .\r\n\r\nFigure 6 Change Data Type \r\n4.2 Data Visualisation\r\n 1) Worksheet 1: Merchandise Trade Balance by Six Countries (2019Q1-2020Q4) \r\nTo measure merchandise data change, use Quarter measure. Drag Date to Columns and Drag Merchandise Value to Rows, adjust Date to Quarter Measure. Apply Country to Color to separate six countries. Adjust Size to line chart to make lines more obvious.\r\n\r\nFigure 7 Line Size\r\nThe final edition of worksheet1 shows as follows:\r\n\r\nFigure 8 Worksheet1\r\n 2) Worksheet 2: Merchandise Trade Trend by Six Countries (2019-2020) \r\nTo have a big picture of Merchandise trade type among six countries and know their yearly change rate. Drag Merchandise value to Rows and Country, Merchandise value to columns, change Merchandise column to discrete data type, measure(sum), and apply color to country and Year(Date) to Label.\r\n\r\nFigure 9 Change Data Type\r\nAdd Reference line and Rename this worksheet.\r\n\r\nFigure 10 Reference Line Setting\r\nThe final edition of worksheet2 shows as follows:\r\n\r\nFigure 11 Worksheet2\r\n 3) Worksheet 3: Import-Export Value by Six Countries \r\nNot only to know the Merchandise data, but also to understand export value and import value among six countries from 2019-2020, Create Worksheet 3 to modify. Drag Import Value and Export Value to Columns and drag Country and Time to Rows. Apply Measure Name to Color and Time to Label. To make the axis range same and contrast import and export, right click axis, and click Edit Axis. And then unify fixed value (0-90000000) in export and import value.\r\n\r\nFigure 12 Edit Axis \r\nEdit Title to highlight Export and Import difference and change color to blue and red separately.\r\n\r\nFigure 13 Edit Title\r\nThe final edition of worksheet3 shows as follows:\r\n\r\nFigure 14 Worksheet3\r\n5.Final Visualisation\r\n5.1 Dashboard\r\nCombine worksheet1 and worksheet 2 and worksheet3 together and allocate their locations in the dashboard.\r\nFigure 15 Dashboard \r\n5.2 Observation\r\nFrom 2019-2020, Only China and Hong Kong have positive merchandise trade balance, which can be regarded as Export Countries, America has negative merchandise trade value in 2019 but its exports outweigh imports in 2020. Other countries have negative merchandise trade value in both two years.\r\nFrom 2019 to 2020, Japan has the most stable growth rate, which is nearly 5%, followed by Taiwan. Malaysia experience most drastic change of merchandise trade balance in these two years.\r\nMainland China has both the highest import value and highest export value compared with other countries and districts . Hong Kong has the lowest income values compared with those of other countries and districts.\r\nOnly Malaysia and Taiwan experienced decline in merchandise trade value from 2019-2020, other countries grows well merchandise trade in these two years.\r\nFrom 2019 to 2020, America performs very well in growth rate of merchandise trade, while Malaysia performs the worst.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-26T23:02:09+08:00",
    "input_file": "dataviz1.utf8.md"
  }
]
